//AUTOG020  JOB  1,NOTIFY=&SYSUID
//COBOL1    EXEC IGYWCLG,
//          PARM.COBOL='XREF,LIB'
//COBOL.SYSPRINT DD SYSOUT=*
//COBOL.SYSIN    DD DSN=UNTG020.COBOLPGM(AUTOCBL),DISP=SHR
//GO.SYSOUT      DD SYSOUT=*
//GO.SYSPRINT    DD SYSOUT=*
//GO.AUTOIN      DD DSN=UNTG020.COBOLIN(AUTODATA),DISP=SHR
//GO.AUTOOUT     DD DSN=UNTG020.COBOLOUT(AUTOPRT),DISP=SHR
//
