//MULTG020       JOB  1,NOTIFY=&SYSUID
//STEP1          EXEC PGM=ICEGENER
//SYSUT1         DD DSN=UNTG020.COBOLIN(AUTODATA),DISP=SHR
//SYSUT2         DD DSN=UNTG020.COBOLOUT(MULTIOUT),DISP=SHR
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD DUMMY
//STEP2          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD *
  DELETE UNTG020.COBOLIN(AUTONEW)
/*
//STEP3          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD *
  DELETE UNTG020.COBOLIN(NEWLIST)
/*
//STEP4          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//OLDINV         DD DSN=UNTG020.COBOLIN(AUTODATA),DISP=SHR
//NEWINV         DD DSN=UNTG020.COBOLIN(AUTONEW),DISP=SHR
//SYSIN          DD *
  REPRO INFILE(OLDINV) OUTFILE(NEWINV)
/*
//STEP5          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//AUTONEW        DD DSN=UNTG020.COBOLIN(AUTONEW),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(AUTONEW) CHAR
/*
//STEP6          EXEC PGM=IKJEFT01
//SYSPRINT       DD SYSOUT=*
//SYSTSPRT       DD SYSOUT=*
//SYSTSIN        DD *
  RENAME 'UNTG020.COBOLIN(AUTONEW)' 'UNTG020.COBOLIN(ITDSDATA)'
/*
//STEP7          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//ITDSDATA       DD DSN=UNTG020.COBOLIN(ITDSDATA),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(ITDSDATA) CHAR
/*
//STEP8          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//OLDINV         DD DSN=UNTG020.COBOLIN(ITDSDATA),DISP=SHR
//NEWINV         DD DSN=UNTG020.COBOLIN(NEWLIST),DISP=SHR
//SYSIN          DD *
  REPRO INFILE(OLDINV) OUTFILE(NEWINV)
/*
//STEP9          EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//NEWLIST        DD DSN=UNTG020.COBOLIN(NEWLIST),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(NEWLIST) CHAR
/*
//STEP10         EXEC PGM=IKJEFT01
//SYSPRINT       DD SYSOUT=*
//SYSTSPRT       DD SYSOUT=*
//SYSTSIN        DD *
  RENAME 'UNTG020.COBOLIN(NEWLIST)' 'UNTG020.COBOLIN(FINALCAR)'
/*
//STEP11         EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//FINALCAR       DD DSN=UNTG020.COBOLIN(FINALCAR),DISP=SHR
//SYSIN          DD *
  PRINT INFILE(FINALCAR) CHAR
/*
//STEP12         EXEC PGM=IDCAMS
//SYSPRINT       DD SYSOUT=*
//SYSIN          DD *
  DELETE UNTG020.COBOLIN(ITDSDATA)
//
